# GetDLOptions

## Description
Gets the Double Line Preferences options.  0 for Create Lines, 1 for Create Polygons, 2 for Create Lines and Polygons.

```pascal
FUNCTION GetDLOptions : INTEGER;
```

```python

def vs.GetDLOptions():
    return INTEGER
```

## See Also
VS Functions:
SetDLOptions

## Version
Availability: from VectorWorks12.5
## Category
* Document Settings